XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/hbn_reg.h
/* 0x2C : HBN_BOR_CFG */
#define HBN_BOR_CFG_OFFSET (0x2C)
#define HBN_BOD_SEL        HBN_BOD_SEL
#define HBN_BOD_SEL_POS    (0U)
#define HBN_BOD_SEL_LEN    (1U)
#define HBN_BOD_SEL_MSK    (((1U << HBN_BOD_SEL_LEN) - 1) << HBN_BOD_SEL_POS)
#define HBN_BOD_SEL_UMSK   (~(((1U << HBN_BOD_SEL_LEN) - 1) << HBN_BOD_SEL_POS))
#define HBN_BOD_VTH        HBN_BOD_VTH
#define HBN_BOD_VTH_POS    (1U)
#define HBN_BOD_VTH_LEN    (3U)
#define HBN_BOD_VTH_MSK    (((1U << HBN_BOD_VTH_LEN) - 1) << HBN_BOD_VTH_POS)
#define HBN_BOD_VTH_UMSK   (~(((1U << HBN_BOD_VTH_LEN) - 1) << HBN_BOD_VTH_POS))
#define HBN_PU_BOD         HBN_PU_BOD
#define HBN_PU_BOD_POS     (4U)
#define HBN_PU_BOD_LEN     (1U)
#define HBN_PU_BOD_MSK     (((1U << HBN_PU_BOD_LEN) - 1) << HBN_PU_BOD_POS)
#define HBN_PU_BOD_UMSK    (~(((1U << HBN_PU_BOD_LEN) - 1) << HBN_PU_BOD_POS))
#define HBN_R_BOD_OUT      HBN_R_BOD_OUT
#define HBN_R_BOD_OUT_POS  (5U)
#define HBN_R_BOD_OUT_LEN  (1U)
#define HBN_R_BOD_OUT_MSK  (((1U << HBN_R_BOD_OUT_LEN) - 1) << HBN_R_BOD_OUT_POS)
#define HBN_R_BOD_OUT_UMSK (~(((1U << HBN_R_BOD_OUT_LEN) - 1) << HBN_R_BOD_OUT_POS))

/* 0x30 : HBN_GLB */
#define HBN_GLB_OFFSET                    (0x30)
#define HBN_ROOT_CLK_SEL                  HBN_ROOT_CLK_SEL
#define HBN_ROOT_CLK_SEL_POS              (0U)
#define HBN_ROOT_CLK_SEL_LEN              (2U)
#define HBN_ROOT_CLK_SEL_MSK              (((1U << HBN_ROOT_CLK_SEL_LEN) - 1) << HBN_ROOT_CLK_SEL_POS)
#define HBN_ROOT_CLK_SEL_UMSK             (~(((1U << HBN_ROOT_CLK_SEL_LEN) - 1) << HBN_ROOT_CLK_SEL_POS))
#define HBN_UART_CLK_SEL                  HBN_UART_CLK_SEL
#define HBN_UART_CLK_SEL_POS              (2U)
#define HBN_UART_CLK_SEL_LEN              (1U)
#define HBN_UART_CLK_SEL_MSK              (((1U << HBN_UART_CLK_SEL_LEN) - 1) << HBN_UART_CLK_SEL_POS)
#define HBN_UART_CLK_SEL_UMSK             (~(((1U << HBN_UART_CLK_SEL_LEN) - 1) << HBN_UART_CLK_SEL_POS))
#define HBN_F32K_SEL                      HBN_F32K_SEL
#define HBN_F32K_SEL_POS                  (3U)
#define HBN_F32K_SEL_LEN                  (2U)
#define HBN_F32K_SEL_MSK                  (((1U << HBN_F32K_SEL_LEN) - 1) << HBN_F32K_SEL_POS)
#define HBN_F32K_SEL_UMSK                 (~(((1U << HBN_F32K_SEL_LEN) - 1) << HBN_F32K_SEL_POS))
#define HBN_RESET_EVENT                   HBN_RESET_EVENT
#define HBN_RESET_EVENT_POS               (7U)
#define HBN_RESET_EVENT_LEN               (6U)
#define HBN_RESET_EVENT_MSK               (((1U << HBN_RESET_EVENT_LEN) - 1) << HBN_RESET_EVENT_POS)
#define HBN_RESET_EVENT_UMSK              (~(((1U << HBN_RESET_EVENT_LEN) - 1) << HBN_RESET_EVENT_POS))
#define HBN_CLR_RESET_EVENT               HBN_CLR_RESET_EVENT
#define HBN_CLR_RESET_EVENT_POS           (13U)
#define HBN_CLR_RESET_EVENT_LEN           (1U)
#define HBN_CLR_RESET_EVENT_MSK           (((1U << HBN_CLR_RESET_EVENT_LEN) - 1) << HBN_CLR_RESET_EVENT_POS)
#define HBN_CLR_RESET_EVENT_UMSK          (~(((1U << HBN_CLR_RESET_EVENT_LEN) - 1) << HBN_CLR_RESET_EVENT_POS))
#define HBN_UART_CLK_SEL2                 HBN_UART_CLK_SEL2
#define HBN_UART_CLK_SEL2_POS             (15U)
#define HBN_UART_CLK_SEL2_LEN             (1U)
#define HBN_UART_CLK_SEL2_MSK             (((1U << HBN_UART_CLK_SEL2_LEN) - 1) << HBN_UART_CLK_SEL2_POS)
#define HBN_UART_CLK_SEL2_UMSK            (~(((1U << HBN_UART_CLK_SEL2_LEN) - 1) << HBN_UART_CLK_SEL2_POS))
#define HBN_SW_LDO11SOC_VOUT_SEL_AON      HBN_SW_LDO11SOC_VOUT_SEL_AON
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_POS  (16U)
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_LEN  (4U)
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_MSK  (((1U << HBN_SW_LDO11SOC_VOUT_SEL_AON_LEN) - 1) << HBN_SW_LDO11SOC_VOUT_SEL_AON_POS)
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_UMSK (~(((1U << HBN_SW_LDO11SOC_VOUT_SEL_AON_LEN) - 1) << HBN_SW_LDO11SOC_VOUT_SEL_AON_POS))
#define HBN_SW_LDO11_RT_VOUT_SEL          HBN_SW_LDO11_RT_VOUT_SEL
#define HBN_SW_LDO11_RT_VOUT_SEL_POS      (24U)
#define HBN_SW_LDO11_RT_VOUT_SEL_LEN      (4U)
#define HBN_SW_LDO11_RT_VOUT_SEL_MSK      (((1U << HBN_SW_LDO11_RT_VOUT_SEL_LEN) - 1) << HBN_SW_LDO11_RT_VOUT_SEL_POS)
#define HBN_SW_LDO11_RT_VOUT_SEL_UMSK     (~(((1U << HBN_SW_LDO11_RT_VOUT_SEL_LEN) - 1) << HBN_SW_LDO11_RT_VOUT_SEL_POS))
#define HBN_SW_LDO11_AON_VOUT_SEL         HBN_SW_LDO11_AON_VOUT_SEL
#define HBN_SW_LDO11_AON_VOUT_SEL_POS     (28U)
#define HBN_SW_LDO11_AON_VOUT_SEL_LEN     (4U)
#define HBN_SW_LDO11_AON_VOUT_SEL_MSK     (((1U << HBN_SW_LDO11_AON_VOUT_SEL_LEN) - 1) << HBN_SW_LDO11_AON_VOUT_SEL_POS)
#define HBN_SW_LDO11_AON_VOUT_SEL_UMSK    (~(((1U << HBN_SW_LDO11_AON_VOUT_SEL_LEN) - 1) << HBN_SW_LDO11_AON_VOUT_SEL_POS))

/* 0x34 : HBN_SRAM */
#define HBN_SRAM_OFFSET     (0x34)
#define HBN_RETRAM_RET      HBN_RETRAM_RET
#define HBN_RETRAM_RET_POS  (6U)
#define HBN_RETRAM_RET_LEN  (1U)
#define HBN_RETRAM_RET_MSK  (((1U << HBN_RETRAM_RET_LEN) - 1) << HBN_RETRAM_RET_POS)
#define HBN_RETRAM_RET_UMSK (~(((1U << HBN_RETRAM_RET_LEN) - 1) << HBN_RETRAM_RET_POS))
#define HBN_RETRAM_SLP      HBN_RETRAM_SLP
#define HBN_RETRAM_SLP_POS  (7U)
#define HBN_RETRAM_SLP_LEN  (1U)
#define HBN_RETRAM_SLP_MSK  (((1U << HBN_RETRAM_SLP_LEN) - 1) << HBN_RETRAM_SLP_POS)
#define HBN_RETRAM_SLP_UMSK (~(((1U << HBN_RETRAM_SLP_LEN) - 1) << HBN_RETRAM_SLP_POS))

/* 0x38 : HBN_PAD_CTRL_0 */
#define HBN_PAD_CTRL_0_OFFSET          (0x38)
#define HBN_REG_AON_PAD_IE_SMT         HBN_REG_AON_PAD_IE_SMT
#define HBN_REG_AON_PAD_IE_SMT_POS     (0U)
#define HBN_REG_AON_PAD_IE_SMT_LEN     (9U)
#define HBN_REG_AON_PAD_IE_SMT_MSK     (((1U << HBN_REG_AON_PAD_IE_SMT_LEN) - 1) << HBN_REG_AON_PAD_IE_SMT_POS)
#define HBN_REG_AON_PAD_IE_SMT_UMSK    (~(((1U << HBN_REG_AON_PAD_IE_SMT_LEN) - 1) << HBN_REG_AON_PAD_IE_SMT_POS))
#define HBN_REG_AON_LED_SEL            HBN_REG_AON_LED_SEL
#define HBN_REG_AON_LED_SEL_POS        (10U)
#define HBN_REG_AON_LED_SEL_LEN        (9U)
#define HBN_REG_AON_LED_SEL_MSK        (((1U << HBN_REG_AON_LED_SEL_LEN) - 1) << HBN_REG_AON_LED_SEL_POS)
#define HBN_REG_AON_LED_SEL_UMSK       (~(((1U << HBN_REG_AON_LED_SEL_LEN) - 1) << HBN_REG_AON_LED_SEL_POS))
#define HBN_REG_EN_AON_CTRL_GPIO       HBN_REG_EN_AON_CTRL_GPIO
#define HBN_REG_EN_AON_CTRL_GPIO_POS   (20U)
#define HBN_REG_EN_AON_CTRL_GPIO_LEN   (9U)
#define HBN_REG_EN_AON_CTRL_GPIO_MSK   (((1U << HBN_REG_EN_AON_CTRL_GPIO_LEN) - 1) << HBN_REG_EN_AON_CTRL_GPIO_POS)
#define HBN_REG_EN_AON_CTRL_GPIO_UMSK  (~(((1U << HBN_REG_EN_AON_CTRL_GPIO_LEN) - 1) << HBN_REG_EN_AON_CTRL_GPIO_POS))
#define HBN_REG_AON_GPIO_ISO_MODE      HBN_REG_AON_GPIO_ISO_MODE
#define HBN_REG_AON_GPIO_ISO_MODE_POS  (31U)
#define HBN_REG_AON_GPIO_ISO_MODE_LEN  (1U)
#define HBN_REG_AON_GPIO_ISO_MODE_MSK  (((1U << HBN_REG_AON_GPIO_ISO_MODE_LEN) - 1) << HBN_REG_AON_GPIO_ISO_MODE_POS)
#define HBN_REG_AON_GPIO_ISO_MODE_UMSK (~(((1U << HBN_REG_AON_GPIO_ISO_MODE_LEN) - 1) << HBN_REG_AON_GPIO_ISO_MODE_POS))

/* 0x3C : HBN_PAD_CTRL_1 */
#define HBN_PAD_CTRL_1_OFFSET   (0x3C)
#define HBN_REG_AON_PAD_OE      HBN_REG_AON_PAD_OE
#define HBN_REG_AON_PAD_OE_POS  (0U)
#define HBN_REG_AON_PAD_OE_LEN  (9U)
#define HBN_REG_AON_PAD_OE_MSK  (((1U << HBN_REG_AON_PAD_OE_LEN) - 1) << HBN_REG_AON_PAD_OE_POS)
#define HBN_REG_AON_PAD_OE_UMSK (~(((1U << HBN_REG_AON_PAD_OE_LEN) - 1) << HBN_REG_AON_PAD_OE_POS))
#define HBN_REG_AON_PAD_PD      HBN_REG_AON_PAD_PD
#define HBN_REG_AON_PAD_PD_POS  (10U)
#define HBN_REG_AON_PAD_PD_LEN  (9U)
#define HBN_REG_AON_PAD_PD_MSK  (((1U << HBN_REG_AON_PAD_PD_LEN) - 1) << HBN_REG_AON_PAD_PD_POS)
#define HBN_REG_AON_PAD_PD_UMSK (~(((1U << HBN_REG_AON_PAD_PD_LEN) - 1) << HBN_REG_AON_PAD_PD_POS))
#define HBN_REG_AON_PAD_PU      HBN_REG_AON_PAD_PU
#define HBN_REG_AON_PAD_PU_POS  (20U)
#define HBN_REG_AON_PAD_PU_LEN  (9U)
#define HBN_REG_AON_PAD_PU_MSK  (((1U << HBN_REG_AON_PAD_PU_LEN) - 1) << HBN_REG_AON_PAD_PU_POS)
#define HBN_REG_AON_PAD_PU_UMSK (~(((1U << HBN_REG_AON_PAD_PU_LEN) - 1) << HBN_REG_AON_PAD_PU_POS))

/* 0x100 : HBN_RSV0 */
#define HBN_RSV0_OFFSET (0x100)
#define HBN_RSV0        HBN_RSV0
#define HBN_RSV0_POS    (0U)
#define HBN_RSV0_LEN    (32U)
#define HBN_RSV0_MSK    (((1U << HBN_RSV0_LEN) - 1) << HBN_RSV0_POS)
#define HBN_RSV0_UMSK   (~(((1U << HBN_RSV0_LEN) - 1) << HBN_RSV0_POS))

