XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/hbn_reg.h
    /* 0x104 : HBN_RSV1 */
    union {
        struct {
            uint32_t HBN_RSV1 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } HBN_RSV1;

    /* 0x108 : HBN_RSV2 */
    union {
        struct {
            uint32_t HBN_RSV2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_RSV2;

    /* 0x10C : HBN_RSV3 */
    union {
        struct {
            uint32_t HBN_RSV3 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } HBN_RSV3;

    /* 0x110  reserved */
    uint8_t RESERVED0x110[240];

    /* 0x200 : rc32k_ctrl0 */
    union {
        struct {
            uint32_t rc32k_cal_done        : 1;  /* [    0],          r,        0x1 */
            uint32_t rc32k_rdy             : 1;  /* [    1],          r,        0x1 */
            uint32_t rc32k_cal_inprogress  : 1;  /* [    2],          r,        0x0 */
            uint32_t rc32k_cal_div         : 2;  /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32k_cal_precharge   : 1;  /* [    5],          r,        0x0 */
            uint32_t rc32k_dig_code_fr_cal : 10; /* [15: 6],          r,      0x200 */
            uint32_t rc32k_vref_dly        : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t rc32k_allow_cal       : 1;  /* [   18],        r/w,        0x0 */
            uint32_t rc32k_ext_code_en     : 1;  /* [   19],        r/w,        0x1 */
            uint32_t rc32k_cal_en          : 1;  /* [   20],        r/w,        0x0 */
            uint32_t pu_rc32k              : 1;  /* [   21],        r/w,        0x1 */
            uint32_t rc32k_code_fr_ext     : 10; /* [31:22],        r/w,      0x12c */
        } BF;
        uint32_t WORD;
    } rc32k_ctrl0;

    /* 0x204 : xtal32k */
    union {
        struct {
            uint32_t reserved_0_1         : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t xtal32k_ext_sel      : 1; /* [    2],        r/w,        0x0 */
            uint32_t xtal32k_amp_ctrl     : 2; /* [ 4: 3],        r/w,        0x1 */
            uint32_t xtal32k_reg          : 2; /* [ 6: 5],        r/w,        0x1 */
            uint32_t xtal32k_outbuf_stre  : 1; /* [    7],        r/w,        0x0 */
            uint32_t xtal32k_otf_short    : 1; /* [    8],        r/w,        0x0 */
            uint32_t xtal32k_inv_stre     : 2; /* [10: 9],        r/w,        0x1 */
            uint32_t xtal32k_capbank      : 6; /* [16:11],        r/w,       0x20 */
            uint32_t xtal32k_ac_cap_short : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_xtal32k_buf       : 1; /* [   18],        r/w,        0x1 */
            uint32_t pu_xtal32k           : 1; /* [   19],        r/w,        0x0 */
            uint32_t xtal32k_hiz_en       : 1; /* [   20],        r/w,        0x1 */
            uint32_t reserved_21          : 1; /* [   21],       rsvd,        0x0 */
            uint32_t dten_xtal32k         : 1; /* [   22],        r/w,        0x0 */
            uint32_t ten_xtal32k          : 1; /* [   23],        r/w,        0x0 */
            uint32_t f32k_sel_rtc         : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31       : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } xtal32k;

    /* 0x208 : rtc_rst_ctrl */
    union {
        struct {
            uint32_t rtc_rst_wait_cnt_rtc : 16; /* [15: 0],        r/w,     0x3c00 */
            uint32_t rtc_rst_refdiv_rtc   : 3;  /* [18:16],        r/w,        0x4 */
            uint32_t rtc_rst_ctrl_misc    : 13; /* [31:19],        r/w,      0xa12 */
        } BF;
        uint32_t WORD;
    } rtc_rst_ctrl;

    /* 0x20C : rtc_rst_ctrl2 */
    union {
        struct {
            uint32_t rtc_resv           : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_en_hw_pu_rc32k : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31      : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rtc_rst_ctrl2;
};

typedef volatile struct hbn_reg hbn_reg_t;

#endif /* __HBN_REG_H__ */
